t = int(input('Укажите количество минут: '))

print(t, 'мин - это', t//60, 'час', t%60, 'минут.')
