#Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:

#             «Hello [введенное имя] [введенная фамилия]! You just delved into Python».

fn = input('Enter ur name: ')
sn = input('Enter ur surname: ')

print('Hello ' + fn + ' ' + sn + '! You just delved into Python')
