# Напишите программу, которая определяет наименьшее из двух чисел.

n = int(input('Введите 1 число: '))
m = int(input('Введите 2 число: '))

if n > m:
    print(m)
else:
    print(n)
