# Напишите программу, которая определяет, разрешен пользователю доступ к интернет-ресурсу или нет.

age = int(input('Введите Ваш возраст: '))

if age >= 18:
    print("Доступ разрешен")
else:
    print("Доступ запрещен")
